================================================================================
literal string
================================================================================

'hi'

--------------------------------------------------------------------------------

(source_file
    (string))

================================================================================
literal number
================================================================================

123

--------------------------------------------------------------------------------

(source_file
  (number))

================================================================================
literal data
================================================================================

{x:1,y:'hello'}

--------------------------------------------------------------------------------

(source_file
  (data
    (function_definition
      (identifier)
      (number))
    (function_definition
      (identifier)
        (string))))

================================================================================
empty data
================================================================================

{}

--------------------------------------------------------------------------------

(source_file
  (data))

================================================================================
data with shorthand fill
================================================================================

a: 10

{ a }

--------------------------------------------------------------------------------

(source_file
  (function_definition
  (identifier)
      (number))
  (data
    (identifier)))
  

================================================================================
empty list
================================================================================

[]

--------------------------------------------------------------------------------

(source_file
  (list))


================================================================================
literal list
================================================================================

['hello','world']

--------------------------------------------------------------------------------

(source_file
  (list
    (string)
    (string)))


================================================================================
identifier
================================================================================

sayHi

--------------------------------------------------------------------------------

(source_file
    (function_call
      (identifier)))


================================================================================
function
================================================================================

sayHi: 'hi'

--------------------------------------------------------------------------------

(source_file
  (function_definition
    (identifier)
    (string)))

================================================================================
multi-line function
================================================================================

sayHi:
  'hi'

--------------------------------------------------------------------------------

(source_file
  (function_definition
    (identifier)
    (string)))

          
================================================================================
function call function
================================================================================

print a

--------------------------------------------------------------------------------

(source_file
  (function_call
    (identifier)
    (function_call
      (identifier))))


================================================================================
define and call
================================================================================

a: 10

a

--------------------------------------------------------------------------------

(source_file
  (function_definition
    (identifier)
    (number))
  (function_call
      (identifier)))


================================================================================
call after call
================================================================================


print reverse 'asd'


--------------------------------------------------------------------------------

(source_file
  (function_call
    (identifier)
    (function_call
      (identifier)
      (string))))


================================================================================
invalid function def
================================================================================

do:

--------------------------------------------------------------------------------


(source_file
  (function_call
	  (identifier))
	  (ERROR))


================================================================================
nested
================================================================================

do:
  handle:
    personName: 'john'
    personName
  handle

--------------------------------------------------------------------------------

(source_file
  (function_definition
    (identifier)
      (function_definition
				(identifier)
          (function_definition
				    (identifier)
				      (string))
        (function_call
				  (identifier))
				(function_call
				  (identifier)))))

================================================================================
function with argument
================================================================================

printName name:
    print name 

--------------------------------------------------------------------------------

(source_file
  (function_definition
    (identifier)
      (function_definition
				(identifier)
          (function_definition
				    (identifier)
				      (string))
        (function_call
				  (identifier))
				(function_call
				  (identifier)))))
